---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelCurveArrArray
source: html/b848277b-0af9-0ec6-74b4-ae1794004bc2.htm
---
# ModelCurveArrArray Methods

Removes every item from the array, rendering it empty.